<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Book;
use App\Models\Author;
use App\Models\Category;
use App\Models\Image;
use App\Models\Publisher;
use App\Models\User;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $book1 = Book::create([
            'user_id' => 1,
            'title' => 'التوظيف عن بعد',
            'slug' => 'التوظيف_عن_بعد',
            'description' => 'في السنوات الأخيرة انتشر على الصعيد العالمي نظام العمل عن بُعد، حيث تلجأ العديد من الشركات والمؤسسات – وكذلك الأفراد – إلى الاستعانة بأفراد يعملون عن بُعد من المنزل أو أي مكان في العالم عبر الإنترنت.
            تلجأ الشركات إلى العاملين عن بُعد في مختلف التخصصات، منها على سبيل المثال لا الحصر العاملين في مجال البرمجة، وتحرير النصوص، والتسويق الشبكي، والتسويق الإلكتروني،  والهندسة، والتصميم والإعلانات، والترجمة، والديكور الداخلي، وإدخال البيانات، وبعض أعمال السكرتارية، وحجز تذاكر الطيران، وكتابة المقالات، وبعض أعمال العلاقات العامة عبر الإنترنت، وتصميم المواقع الإلكترونية وإدارة المواقع الإلكترونية، والدراسات والتحاليل السوقية وغيرها من التخصصات.
            
            ولابُد أن السؤال الذي يبادرنا هو: لماذا كل هذه الأهمية لنظام العمل عن بُعد، وكيف يمكنني الاستفادة من هذا النظام في مؤسستي؟
            تعالوا لنتعرف معاً على الجواب من خلال هذا الكتاب',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '17',
            'isbn'=>'100000000000',
            'cover_image' => 'images/books/covers/img-1.png',
        ]);
        $book1->authors()->attach(Author::where('name', 'فاطمة حيشية')->first());
        // $book1->images()->attach(Image::where('id', 1)->first());

        $book2 = Book::create([
            'user_id' => 1,
            'title' => 'مدخل إلى تجربة المستخدم',
            'slug' => 'مدخل_إلى_تجربة_المستخدم',
            'description' => 'يضع هذا الكتاب المُوجز القارئ على أعتاب عالم تصميم تجربة المُستخدمين UX، وهو علم له قواعده وأصوله وأدواته، ويهدف إلى تعريف القارئ المُبتدئ بأساس هذا العلم وكيف يُطبّق على المُنتجات الرّقمية من مواقع ويب خدميّة وتطبيقات على الأجهزة الذّكية وصولًا إلى التّصميم الأمثل الّذي يُوفِّق بين هدف المُستخدم أوّلًا وهدف الخدمة التّجاريّ، الأمر الّذي يعني منتجًا ناجحًا. ',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '22',
            'isbn'=>'100000000001',
            'cover_image' => 'images/books/covers/img-2.png',
        ]);
        $book2->authors()->attach(Author::where('name', 'محمد عرابي')->first());
        
        $book3 = Book::create([ //
            'user_id' => 1,
            'title' => 'دليلك المختصر لبيع المنتجات الرقمية',
            'slug' => 'دليلك_المختصر_لبيع_المنتجات_الرقمية',
            'description' => 'هل لديك وظيفة ولكن طموحك يمنعك من الاعتماد على الوظيفة فقط وأردت أن تبدأ عملك الحر لتحقق المزيد من الدخل والاستقلالية، فأنا ادعوك لقراءة هذا الدليل المختصر بتمعن لتتعرف على المنتجات الرقمية وكيف يمكنك البدء ببيعها، والمفاجأة السارة أنه يمكنك أن تبدأ بالعمل من دون رأس مال في كثير من الأحيان، فكل ما تحتاج إليه لتتمكن من البدء جهاز كمبيوتر وخط اتصال بالإنترنت بالإضافة إلى العمل الجاد والرغبة بالنجاح.
            إذا كنت لا تؤمن بهذا النوع من الأعمال وتعتقد أنها غير مجدية، فأنا أدعوك لأن لا تتعجل، فسأطلعك على قصص نجاح ستغير دون شك من هذا الاعتقاد ولكن بعد أن نستعرض بشكل مختصر بعد المحطات الرئيسية لتطور العملية التجارية في شبكة الإنترنت، بالإضافة إلى لمحة عن وضع الشراء الإلكتروني في العالم العربي.
            أنصحك بالابتعاد عن مصادر الإزعاج وإعداد كوب من القهوة لتبدأ عملك بكل نشاط وتركيز وتكون قادرا على البدء في بناء مستقبلك',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '18',
            'isbn'=>'100000000002',
            'cover_image' => 'images/books/covers/img-3.png',
        ]);
        $book3->authors()->attach(Author::where('name', 'محمد الزاير')->first());
        
        $book4 = Book::create([
            'user_id' => 1,
            'title' => 'دليلك المختصر لبدء العمل عبر الإنترنت',
            'slug' => 'دليلك_المختصر_لبدء_العمل_عبر_الإنترنت',
            'description' => '

            تحية إلى كل الأحرار … لا، هذه ليست دعوة ثورية ضد نظام الحكم للأسف كما قد يخطر ببالك، ولكنها دعوة إلى الثورة على نمط الحياة الممل الذي يحياه معظمنا.
            
            دعوة إلى الحياة بحرية أكبر خارج دائرة مثل "لقمة العيش" و "الحمار المربوط في الساقية" و "عبد المأمور" و "اربط الحمار في المكان الذي يريده صاحبه"، مثل هذه المفاهيم وأكثر كانت -وما زالت- سبب في تأخر أمة بأكملها.
            
            أوصاني أستاذي باستذكار دروسي جيداً حتى أحصل على شهادة جامعية تؤهلني لوظيفة محترمة، مسكين أستاذي، تُرى ماذا سيقول إذا علم أن أشخاص مثل "ستيف جوبز" و "مارك زوكربيرج" و "بيل جيتس" لم يكملوا تعليمهم.
            
            هذه المفاهيم يجب أن تتحطم، وأكثر مفهوم سيسعى هذا الكتاب إلى تحطيمه هو أنه يجب عليك أن تذهب إلى العمل كل يوم.
            
            في هذا الكفاية، افتح الباب الآن، وانظر إلى ما سيفاجئك به عالم اليوم.
            ',
            'number_of_copies' => '300',
            'number_of_pages' => '288',
            'price' => '12',
            'isbn'=>'100000000003',
            'cover_image' => 'images/books/covers/img-4.png',
        ]);
        $book4->authors()->attach(Author::where('name', 'عمر النواوي')->first());
        
         }
}
